# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [10]:
serie_1 = pd.Series(np.random.randint(1, 5, 100), name='serie_1')
serie_2 = pd.Series(np.random.randint(1, 4, 100), name='serie_2')
serie_3 = pd.Series(np.random.randint(10000, 30001, 100), name='serie_3')

### Step 3. Let's create a DataFrame by joinning the Series by column

In [11]:
df = pd.DataFrame({'Serie1': serie_1, 'Serie2': serie_2, 'Serie3': serie_3})
df.head()

   Serie1  Serie2  Serie3
0       4       2   25525
1       4       2   22455
2       1       2   18240
3       4       2   16906
4       3       3   13330

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
df = df.rename(columns={'Serie1': 'bedrs', 'Serie2': 'bathrs', 'Serie3': 'price_sqr_meter'})
df.head()

   bedrs  bathrs  price_sqr_meter
0      4       2            25525
1      4       2            22455
2      1       2            18240
3      4       2            16906
4      3       3            13330

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [13]:
# join concat the values
bigcolumn = pd.concat([serie_1, serie_2, serie_2], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()


bigcolumn

    0
0   4
1   4
2   1
3   4
4   3
.. ..
95  2
96  2
97  3
98  3
99  2

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [14]:
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [15]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

     0
0    4
1    4
2    1
3    4
4    3
..  ..
295  2
296  2
297  3
298  3
299  2

[300 rows x 1 columns]